tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
cask_args appdir: "/Applications"

brew "carthage"
brew "emacs", link: false
brew "ffmpeg"
brew "mas"
brew "ripgrep"
brew "tree"

cask "affinity-designer"
cask "affinity-photo"
cask "arduino"
cask "blender"
cask "deepl"
cask "dropbox"
cask "emacs"
cask "firefox"
cask "google-chrome"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "miro"
cask "multipass"
cask "parallels"
cask "visual-studio-code"
cask "zoom"

mas "BetterSnapTool", id: 417375580
#mas "Leawo Blu-ray Player"
#mas "OneDrive", id: 823766827
#mas "Xcode", id: 497799835
mas "Display Menu", id: 549083868
mas "Slack for Desktop", id:803453959
mas "Microsoft Excel", id:462058435